package com.magus.enviroment.ep.constant;

/**
 * 常量类
 * Author huarizhong
 * Date 2015/1/7
 * Time 10:55
 */
public class ConstantsUtil {




    //请求URL格式  K780_URL_HEAD+"上海"+K780_URL_TAIL
    public static String K780_URL_HEAD_TODAY = "http://api.k780.com:88/?app=weather.today&weaid=";
    public static String K780_URL_HEAD_WEEK = "http://api.k780.com:88/?app=weather.future&weaid=";
    public static String K780_URL_TAIL = "&appkey=12801&sign=e3d554fda250a7171ec0e0a4035ba841&format=json";
    public static String K780_APP_KEY = "12801";
    public static String K780_SIGN = "e3d554fda250a7171ec0e0a4035ba841";
    public static String K780_SECRET = "238dc1627221a4e9e01ba4bad107a07b";
    /**
     * 请求省的URL
     */
    public static final String URL_PROVINCE = "http://www.weather.com.cn/data/city3jdata/china.html";
    /**
     * 请求市的URL
     */
    public static final String URL_CITY = "http://www.weather.com.cn/data/city3jdata/provshi/10119.html";
    /**
     * 一周天气URL
     */
    public static final String URL_WEATHER_WEEK = "http://m.weather.com.cn/data/101190101.html";
    /**
     * 当天天气详细信息
     */
    public static final String URL_WEATHER_DETAIL = "http://www.weather.com.cn/data/sk/101190101.html";

    /**
     * 省
     */
    public static final String[] PROVINCES = {
            "北京", "上海", "天津", "重庆", "黑龙江", "吉林", "辽宁", "内蒙古", "河北", "山西",
            "陕西", "山东", "新疆", "西藏", "青海", "甘肃", "宁夏", "河南", "江苏", "湖北",
            "浙江", "安徽", "福建", "江西", "湖南", "贵州", "四川", "广东", "云南", "广西",
            "海南"};
    public static final String[] PROVINCES_CODE = {
            "10101", "10102", "10103", "10104", "10105", "10106", "10107", "10108", "10109", "10110",
            "10111", "10112", "10113", "10114", "10115", "10116", "10117", "10118", "10119", "10120",
            "10121", "10122", "10123", "10124", "10125", "10126", "10127", "10128", "10129", "10130",
            "10131", "10132", "10133", "10134"};
    public static String[][] CITIES = {
            {"北京", "朝阳", "顺义", "海淀", "怀柔", "通州", "昌平", "延庆", "丰台", "石景山", "大兴", "房山", "密云", "门头沟", "平谷"},
            {"上海", "闵行", "宝山", "嘉定", "南汇", "浦东", "金山", "青浦", "松江", "奉贤", "崇明", "徐家汇", "金山"},
            {"天津", "宝坻", "东丽", "西青", "北辰", "蓟县", "汉沽", "静海", "津南", "塘沽", "大港", "武清", "宁河"},
            {"重庆", "永川", "秀山", "酉阳", "綦江", "彭水", "武隆", "丰都", "璧山", "铜梁", "荣昌", "大足", "石柱", "忠县", "梁平", "垫江", "潼南", "巫山", "奉节", "巫溪",
                    "云阳", "城口", "开县", "涪陵", "万州龙宝", "黔江", "长寿", "巴南", "北碚", "渝北", "万盛", "江津", "南川", "合川"},
            {"哈尔滨", "肇东", "伊春", "鹤岗", "双鸭江", "牡丹江", "鸡西", "大庆", "五大连池", "大兴安岭", "齐齐哈尔", "阿城", "绥化", "佳木斯", "七台河",
                    "同江", "绥汾河", "黑河", "北安"},
            {"长春", "四平", "延吉", "白山", "白城", "辽源", "松原", "吉林", "通化"},
            {"沈阳", "鞍山", "抚顺", "本溪", "丹东", "葫芦岛", "营口", "阜新", "辽阳", "铁岭", "朝阳", "盘锦", "大连", "锦州"},
            {"呼和浩特", "乌海", "集宁", "通辽", "阿拉善左旗", "鄂尔多斯", "临河", "锡林浩特", "乌兰浩特", "包头", "赤峰"},
            {"石家庄", "张家口", "承德", "唐山", "秦皇岛", "沧州", "衡水", "邢台", "邯郸", "保定", "廊坊"},
            {"太原", "临汾", "运城", "朔州", "忻州", "长治", "大同", "阳泉", "晋中", "晋城", "吕梁"},

            {"渭南", "咸阳", "宝鸡", "汉中", "安康", "商洛", "铜川", "榆林", "延安", "西安"},
            {"泰安", "济宁", "烟台", "德州", "淄博", "青岛", "聊城", "莱芜", "日照", "枣庄", "威海", "东营", "滨州", "菏泽", "临沂", "潍坊", "济南"},
            {"乌鲁木齐", "石河子", "昌吉", "吐鲁番", "库尔勒", "阿拉尔", "阿克苏", "喀什", "伊宁", "塔城", "哈密", "和田", "阿勒泰", "阿图什", "博乐", "克拉玛依"},
            {"拉萨", "山南", "阿里", "昌都", "那曲", "日喀则", "林芝"},
            {"西宁", "黄南", "海北", "果洛", "玉树", "海西", "海东", "海南"},
            {"兰州", "平凉", "庆阳", "武威", "金昌", "嘉峪关", "酒泉", "天水", "武都", "临夏", "合作", "白银", "定西", "张掖"},
            {"银川", "中卫", "固原", "石嘴山", "吴忠"},
            {"郑州", "新乡", "许昌", "平顶山", "信阳", "南阳", "开封", "洛阳", "商丘", "焦作", "鹤壁", "濮阳", "周口", "漯河", "驻马店", "三门峡", "济源", "安阳"},
            {"南京", "镇江", "苏州", "南通", "扬州", "宿迁", "徐州", "淮安", "连云港", "常州", "泰州", "无锡", "盐城"},
            {"武汉", "黄冈", "荆州", "宜昌", "恩施", "十堰", "神农架", "随州", "荆门", "天门", "仙桃", "潜江", "襄阳", "鄂州", "孝感", "黄石", "咸宁"},

            {"杭州", "舟山", "湖州", "嘉兴", "金华", "绍兴", "台州", "温州", "丽水", "衢州", "宁波"},
            {"合肥", "芜湖", "淮南", "马鞍山", "安庆", "宿州", "阜阳", "亳州", "黄山", "滁州", "淮北", "铜陵", "宣城", "六安", "池州", "蚌埠"},
            {"福州", "泉州", "漳州", "龙岩", "晋江", "南平", "厦门", "宁德", "莆田", "三明"},
            {"南昌", "上饶", "抚州", "宜春", "鹰潭", "赣州", "景德镇", "萍乡", "新余", "九江", "吉安"},
            {"长沙", "株洲", "衡阳", "郴州", "常德", "益阳", "娄底", "邵阳", "岳阳", "张家界", "怀化", "永州", "吉首", "湘潭"},
            {"贵阳", "安顺", "都匀", "铜仁", "毕节", "六盘水", "遵义", "凯里"},
            {"成都", "自贡", "绵阳", "南充", "达州", "遂宁", "广安", "巴中", "泸州", "宜宾", "内江", "资阳", "乐山", "眉山", "凉山", "雅安", "甘孜", "阿坝", "德阳"
                    , "广元", "攀枝花"},
            {"广州", "惠州", "梅州", "汕头", "深圳", "珠海", "肇庆", "湛江", "江门", "河源", "清远", "云浮", "潮州", "东莞", "中山", "阳江", "揭阳", "茂名", "汕尾",
                    "韶关"},
            {"昆明", "红河", "文山", "玉溪", "楚雄", "普洱", "昭通", "临沧", "怒江", "香格里拉", "丽江", "德宏", "景洪", "大理", "曲靖", "保山"},
            {"南宁", "柳州", "来宾", "桂林", "梧州", "防城港", "贵港", "玉林", "百色", "钦州", "河池", "北海", "崇左", "贺州"},
            {"海口", "三亚", "东方", "临高", "澄迈", "儋州", "昌江", "白沙", "琼中", "定安", "屯昌", "琼海", "文昌", "保亭", "万宁", "陵水", "西沙",
                    "南沙岛", "乐东", "五指山"}
    };

    public static String[][] CITY_CODES = {{"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}
            , {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}
            , {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}
            , {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}
            , {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}
            , {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}
            , {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}
            , {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}
            , {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}, {"101010100", "101010100", "101010100"}};

    public static String[] DEFAULT_CITY = {"北京", "上海", "广州", "深圳", "杭州", "南京", "武汉", "宁波", "长沙", "成都", "拉萨", "哈尔滨"
            , "海口", "贵阳", "郑州", "银川", "乌鲁木齐"};
}
